In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Employeem (id int, name varchar(255), department varchar(255), managerId int)

In [ ]:
insert into Employeem (id, name, department, managerId) values ('101', 'John', 'A', 'None')

In [ ]:
insert into Employeem (id, name, department, managerId) values ('102', 'Dan', 'A', '101')

In [ ]:
insert into Employeem (id, name, department, managerId) values ('103', 'James', 'A', '101')

In [ ]:
insert into Employeem (id, name, department, managerId) values ('104', 'Amy', 'A', '101')

In [ ]:
insert into Employeem (id, name, department, managerId) values ('105', 'Anne', 'A', '101')

In [ ]:
insert into Employeem (id, name, department, managerId) values ('106', 'Ron', 'B', '101')

In [ ]:
select * from employeem

+-----+-------+------------+-----------+
| id  | name  | department | managerId |
+-----+-------+------------+-----------+
| 101 | John  | A          | None      |
+-----+-------+------------+-----------+
| 102 | Dan   | A          | 101       |
+-----+-------+------------+-----------+
| 103 | James | A          | 101       |
+-----+-------+------------+-----------+
| 104 | Amy   | A          | 101       |
+-----+-------+------------+-----------+
| 105 | Anne  | A          | 101       |
+-----+-------+------------+-----------+
| 106 | Ron   | B          | 101       |
+-----+-------+------------+-----------+

## Write a solution to find managers with at least five direct reports.

Return the result table in any order.

## method 1

In [ ]:
select managerid from employeem group by managerid having count(*)>=5

+-----------+
| managerId |
+-----------+
| 101       |
+-----------+

In [ ]:
select name from employeem where id in (
    select managerid from employeem group by managerid having count(*)>=5
)

+------+
| name |
+------+
| John |
+------+

## method 2

In [ ]:
select name from employeem as t1 join (
    select managerid from employeem group by managerid having count(*)>=5
) as t2
on t1.id=t2.managerid

+------+
| name |
+------+
| John |
+------+